## Part 9 - Cleaning Data

Importando Numpy y Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
diccionario = {"nombres": ["Manuel", "Tomás", "Sebastián", "Chris", np.nan, None, "NA"],
              "apellido": ["Klug", "Smith", "Parker", "Schafer", None, np.nan, "Missing"],
              "edad": [23, 23, 22, 36, np.nan, np.nan, "Missing"],
              "mails": ["mk@g.com", "tm@g.com", "st@g.com", None, np.nan, "email@g.com", "NA"]}

df = pd.DataFrame(diccionario)

In [3]:
df

     nombres apellido     edad        mails
0     Manuel     Klug       23     mk@g.com
1      Tomás    Smith       23     tm@g.com
2  Sebastián   Parker       22     st@g.com
3      Chris  Schafer       36         None
4        NaN     None      NaN          NaN
5       None      NaN      NaN  email@g.com
6         NA  Missing  Missing           NA

### Eliminar valores nulos:

In [4]:
df.dropna()

     nombres apellido     edad     mails
0     Manuel     Klug       23  mk@g.com
1      Tomás    Smith       23  tm@g.com
2  Sebastián   Parker       22  st@g.com
6         NA  Missing  Missing        NA

In [5]:
# Otra forma:
df.dropna(axis="index", how="any")

     nombres apellido     edad     mails
0     Manuel     Klug       23  mk@g.com
1      Tomás    Smith       23  tm@g.com
2  Sebastián   Parker       22  st@g.com
6         NA  Missing  Missing        NA

In [6]:
# Si hacemos que how="all", entonces eliminará una fila si TODOS los valores de la fila son nulos
df.dropna(axis="index", how="all")

     nombres apellido     edad        mails
0     Manuel     Klug       23     mk@g.com
1      Tomás    Smith       23     tm@g.com
2  Sebastián   Parker       22     st@g.com
3      Chris  Schafer       36         None
5       None      NaN      NaN  email@g.com
6         NA  Missing  Missing           NA

### Argumento subset

In [7]:
df.dropna(axis="index", how="any", subset=["mails"])

     nombres apellido     edad        mails
0     Manuel     Klug       23     mk@g.com
1      Tomás    Smith       23     tm@g.com
2  Sebastián   Parker       22     st@g.com
5       None      NaN      NaN  email@g.com
6         NA  Missing  Missing           NA

### Eliminar otro tipo de valores nulos

In [8]:
df.replace("Na", np.nan, inplace=True)
df.replace("Missing", np.nan, inplace=True)

df

     nombres apellido  edad        mails
0     Manuel     Klug  23.0     mk@g.com
1      Tomás    Smith  23.0     tm@g.com
2  Sebastián   Parker  22.0     st@g.com
3      Chris  Schafer  36.0         None
4        NaN     None   NaN          NaN
5       None      NaN   NaN  email@g.com
6         NA      NaN   NaN           NA

### isna()

In [9]:
df.isna()

   nombres  apellido   edad  mails
0    False     False  False  False
1    False     False  False  False
2    False     False  False  False
3    False     False  False   True
4     True      True   True   True
5     True      True   True  False
6    False      True   True  False

### astype()

In [10]:
df["edad"] = df["edad"].astype(float)

In [11]:
df

     nombres apellido  edad        mails
0     Manuel     Klug  23.0     mk@g.com
1      Tomás    Smith  23.0     tm@g.com
2  Sebastián   Parker  22.0     st@g.com
3      Chris  Schafer  36.0         None
4        NaN     None   NaN          NaN
5       None      NaN   NaN  email@g.com
6         NA      NaN   NaN           NA

In [12]:
df["edad"].mean()

26.0